package seeder

import (
	"fmt"

	"github.com/jinzhu/gorm"
	"github.com/khrongpop/BandSquareAPI/model"
)

func BandTypeSeed(db *gorm.DB) {
	fmt.Println("seed category ...")
	db.Create(&model.BandType{
		ID:     1,
		BandID: 1,
		TypeID: 1,
		Detail: "วงดนตรีเซ็ตเล็กฟังสบาย ประกอบด้วยนักร้องหญิง กีตาร์ ดับเบิ้ลเบส แซ็กโซโฟน (สามารถเพิ่มกลองไฟฟ้า หรือคีย์บอร์ดได้)",
	})
	db.Create(&model.BandType{
		ID:     2,
		BandID: 2,
		TypeID: 1,
		Detail: `เป็นวงดนตรีที่มีตั้งแต่ 2 ชิ้นขึ้นไป (กีตาร์+ร้อง) และในกรณี 3 ชิ้นขึ้นไป ท่านสามารถเลือกได้ว่า "ท่านต้องการได้อะไร"​ (กลอง,แซ๊กโซโฟน หรืออื่นๆ) อีกทั้งท่านยังสามารถคัดเลือกนักร้องชายหญิงได้ตามที่ท่านต้องการ`,
	})
	db.Create(&model.BandType{
		ID:     3,
		BandID: 2,
		TypeID: 2,
		Detail: `-สามารถเพิ่มจำนวนชิ้นที่มีตั้งแต่ 4 คนขึ้นไป / ท่านสามารถคัดเลือกนักร้องได้ด้วยตัวของท่านเอง โดยจะมีทั้งหมด 3คนด้วยกัน (ไฮท์,เติ้ลและแบ๊ด) / สามารถเพิ่มคียบอร์ดหรือแดนซ์เซอร์ได้ / รีเควสแนวดนตรีที่ท่านชอบได้`,
	})
	db.Create(&model.BandType{
		ID:     4,
		BandID: 3,
		TypeID: 1,
		Detail: `วงอคูสติกไซส์เล็ก โดยใช้กีตาร์โปร่ง แซกโซโฟน และคาฮองหรือแพดไฟฟ้า เพิ่มความฟังสบายมากขึ้น สามารถเลือกนักร้องหญิง หรือนักร้องชายได้ มีตั้งแต่ 2-4 ชิ้น`,
	})
	db.Create(&model.BandType{
		ID:     5,
		BandID: 3,
		TypeID: 2,
		Detail: `วงดนตรีฟูลแบนด์ครบเซ็ต 5 คน กีต้าร์ เบสไฟฟ้า/ดับเบิ้ลเบส คีย์บอร์ด กลองชุด แซกโซโฟน สมาชิกสามารถเลือกได้ตั้งแต่วง 5 คน นักร้องชายหรือหญิง 1 คน หรือจะเป็น 7 คน พร้อมนักร้องชายหญิง และเครื่องดนตรีแบบจัดเต็ม`,
	})
	db.Create(&model.BandType{
		ID:     6,
		BandID: 4,
		TypeID: 1,
		Detail: `วงอคูสติกเซ็ตเล็ก แนวเพลง Pop/R&B/Jazz สามารถไปในเซ็ตตั้งแต่ Duo, Trio หรือ Quartet Band ได้ (เลือกได้ว่าจะเป็นกลองชุด หรือกลองไฟฟ้า)`,
	})
	db.Create(&model.BandType{
		ID:     7,
		BandID: 4,
		TypeID: 2,
		Detail: `วงดนตรี Fullband แนว Pop/R&B/Jazz เหมาะกับงานทั้งงานแต่งงาน งานเลี้ยง งานอีเว้นท์ที่ต้องการวงดนตรีชวนโยกไปกับ Groove ของเพลง`,
	})
	db.Create(&model.BandType{
		ID:     8,
		BandID: 5,
		TypeID: 1,
		Detail: `วงดนตรีอคูสติก 3-4 คน นักร้องชาย กีตาร์โปร่ง กลองไฟฟ้า สามารถเพิ่มคีย์บอร์ด หรือ Saxohphone ได้`,
	})
	db.Create(&model.BandType{
		ID:     9,
		BandID: 5,
		TypeID: 2,
		Detail: `วงฟูลแบนด์ 4 - 6 คน ประกอบด้วย นักร้อง กีตาร์ เบส กลอง คีย์บอร์ด หรือ Saxophone`,
	})
	db.Create(&model.BandType{
		ID:     10,
		BandID: 6,
		TypeID: 2,
		Detail: `วงดนตรี Full Band วงดนตรีวาไรตี้ ประกอบด้วยนักร้องนำ กีตาร์ คีย์บอร์ด เบส และกลอง`,
	})
	db.Create(&model.BandType{
		ID:     11,
		BandID: 7,
		TypeID: 1,
		Detail: `วงดนตรีอคุสติก 2 – 3 ชิ้น นักร้อง กีตาร์ และคาฮอง/กลอง หรือสามารถเพิ่มขนาดเป็นวงโฟล์คแบนด์ 3-5 ชิ้น เพิ่มเบสหรือคีย์บอร์ดหรือแซกโซโฟนได้`,
	})
	db.Create(&model.BandType{
		ID:     12,
		BandID: 7,
		TypeID: 2,
		Detail: `วงฟูลแบนด์ แนวเพลงป๊อบร็อค สนุกสนาน เหมาะสำหรับงานเลี้ยง สามารถเพิ่มนักร้องหญิวและแซกโซโฟนได้`,
	})
	db.Create(&model.BandType{
		ID:     13,
		BandID: 7,
		TypeID: 5,
		Detail: `วงดนตรีอคุสติกป๊อบแจ๊ส เหมาะสำหรับงานแต่งงาน งานเลี้ยง งานรื่นเริง งานมงคลต่างๆ สามารถเพิ่มคีย์บอร์ดและนักร้องหญิงได้`,
	})
	db.Create(&model.BandType{
		ID:     14,
		BandID: 8,
		TypeID: 2,
		Detail: `วงดนตรีฟูลแบนด์ มีเครื่องดนตรี 3 ชิ้น ร้องนำ 1 คน สมาชิกแต่ละคนมีประสบการณ์เพียงพอที่จะสามารถคุมวงในสมาชิกจำนวนน้อยๆได้ สมาชิกแต่ละคนมีวิธีประยุกต์การใช้ โน้ต จังหวะ ที่เป็นของเครื่องดนตรีชนิดอื่น เอามาเล่น เพื่ออารมณ์และความละเอียดของเพลงในเครื่องดนตรีของตำแหน่งตนเอง สมาชิกทุกคนสามารถเอนเตอร์เทรนด์ผู้ชมได้อย่างสมอารมณ์`,
	})
	db.Create(&model.BandType{
		ID:     15,
		BandID: 9,
		TypeID: 3,
		Detail: `DJing EDM ///// HOUSE MUSIC (esp. Future House) ///// HIPHOP-R&B ///// TRAP /////`,
	})
	db.Create(&model.BandType{
		ID:     16,
		BandID: 10,
		TypeID: 13,
		Detail: `Djing Hiphop / Tech House / Basshouse / Trap / Twerk / Bigroom / Groove 90`,
	})
	db.Create(&model.BandType{
		ID:     17,
		BandID: 11,
		TypeID: 12,
		Detail: `วงดนตรีฟูลแบนด์ แนวเรกเก้ ดับบ์ (Reggae Dub) ประกอบด้วยเครื่องดนตรี 5 ชิ้น (กลองชุด, เบส, คีย์บอร์ด, ทรอมโบน, แซกโซโฟน) ผสมผสานกับการมิกซ์เสียงแบบ Dub สดๆ`,
	})
}
